export const schoolObjects = [
  'Математика',
  'География',
  'Физика',
  'Химия',
  'Русский язык',
  'Русская литература',
  'Беларусский язык',
  'Беларусская литература',
  'Иностранный',
  'Информатика',
  'Физическая культура',
  'Допризывная подготовка',
  'История',
  'Астрономия',
  'Обществоведение',
];

 export const studentsListNumber = [
  '11A',
  '11Б',
  '10A',
  '10Б',
  '9A',
  '9Б',
  '8A',
  '8Б',
  '7A',
  '7Б',
  '6A',
  '6Б',
  '5A',
  '5Б',
  '4A',
  '4Б',
  '3A',
  '3Б',
  '2A',
  '2Б',
  '1A',
  '1Б',
];

 export const students = [
  'Борозна Олег Александрович',
  'Гиро Егор Сергеевич',
  'Земко Роман Никитич',
  'Казакова Анастасия Сергеевна',
  'Климентова София Маратовна',
  'Ковалёв Захар Николаевич',
  'Коваленок Данила Дмитриевич',
  'Красовская Екатерина Сергеевна',
  'Лелеш Иван Александрович',
  'Лицкевич Владислав Анатольевич',
  'Логовский Евгений Александрович',
  'Майсак Кирилл Александрович',
];

 export const infoClassStudentAndGrid = [
   {
     '11A': {
       'Математика': {'Рабушко Г.Н.':{'01': 4, '07': 7, '14': 5, '23': 9}, 'Кривец М.Д.':{'03': 7, '09': 8, '19': 9, '26': 9}},
       'Геогрфия':{},
       'Физика':{},
       'Геометрия':{}
     }
   }
];
