import { Injectable } from '@angular/core';

@Injectable({
  providedIn: 'root'
})
export class TableItemsService {


  classesSchoolInfo:any = [
    {
      id: '11A',
      days:[
        {
          order: '1',
          id: 'Пн',
          lessons: ['Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык', 'Физра']
        },
        {
          order: '2',
          id: 'Вт',
          lessons: ['Русск.яз.', 'Математика', 'Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '3',
          id:'Ср',
          lessons: ['Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык', 'Физра'],
        },
        {
          order: '4',
          id: 'Чт',
          lessons: ['Алгебра', 'Геометрия', 'Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '5',
          id: 'Пт',
          lessons: ['Труд.об.', 'ДПЮ', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '6',
          id: 'Сб',
          lessons: ['Медицина', 'История', 'Английский язык', 'Физра', 'Английский язык', 'Физра']
        }
      ]
    },
    {
      id: '10Б',
      days: [
        {
          order: '1',
          id: 'Пн',
          lessons: ['Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык', 'Физра']
        },
        {
          order: '2',
          id: 'Вт',
          lessons: ['Русск.яз.', 'Математика', 'Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '3',
          id:'Ср',
          lessons: ['Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык', 'Физра'],
        },
        {
          order: '4',
          id: 'Чт',
          lessons: ['Алгебра', 'Геометрия', 'Английский язык', 'Физра', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '5',
          id: 'Пт',
          lessons: ['Труд.об.', 'ДПЮ', 'Английский язык', 'Физра', 'Английский язык'],
        },
        {
          order: '6',
          id: 'Сб',
          lessons: ['Медицина', 'История', 'Английский язык', 'Физра', 'Английский язык', 'Физра']
        }
      ]
    },
    // {
    //   id: '9А',
    //   lessons: {
    //     'Пн': ['Алгебра', 'Геометрия'],
    //     'Вт': ['Русск.яз.', 'Математика'],
    //     'Ср': ['Бел.лит.', 'Астрономия'],
    //     'Чт': ['Английский', 'Физра'],
    //     'Пт': ['Труд.об.', 'ДПЮ'],
    //     'Сб': []
    //   }
    // },
    // {
    //   id: '9Б',
    //   lessons: {
    //     'Пн': ['Алгебра', 'Геометрия'],
    //     'Вт': ['Русск.яз.', 'Математика'],
    //     'Ср': ['Бел.лит.', 'Астрономия'],
    //     'Чт': ['Английский', 'Физра'],
    //     'Пт': ['Труд.об.', 'ДПЮ'],
    //     'Сб': []
    //   }
    // },
    // {
    //   id: '8A',
    //   lessons: {
    //     'Пн': [],
    //     'Вт': [],
    //     'Ср': [],
    //     'Чт': [],
    //     'Пт': [],
    //     'Сб': []
    //   }
    // },
    // {
    //   id: '7A',
    //   lessons: {
    //     'Пн': [],
    //     'Вт': [],
    //     'Ср': [],
    //     'Чт': [],
    //     'Пт': [],
    //     'Сб': []
    //   }
    // },
    // {
    //   id: '8А',
    //   lessons: {
    //     'Пн': ['Алгебра', 'Геометрия'],
    //     'Вт': ['Русск.яз.', 'Математика'],
    //     'Ср': ['Бел.лит.', 'Астрономия'],
    //     'Чт': ['Английский', 'Физра'],
    //     'Пт': ['Труд.об.', 'ДПЮ'],
    //     'Сб': []
    //   }
    // },
    // {
    //   id: '8Б',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '7А',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '7Б',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '6А',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '6Б',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '5А',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '5Б',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '4А',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '4Б',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '3',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '2',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // },
    // {
    //   id: '1',
    //   lessons:{
    //     'Пн':['Алгебра', 'Геометрия'],
    //     'Вт':['Русск.яз.', 'Математика'],
    //     'Ср':['Бел.лит.', 'Астрономия'],
    //     'Чт':['Английский', 'Физра'],
    //     'Пт':['Труд.об.', 'ДПЮ'],
    //     'Сб':[]
    //   }
    // }
  ];

  constructor() { }

  getLessons():ClassSchool[] {
    return this.classesSchoolInfo;
  };

}

export interface ClassSchool {
  id:string,
  lessons:{[key:string]:string[]},
}
